# Unions

## Instructions

* Using union, write a MySQL statement to query the number of rows in tables `city` and `country`.

![](images/unions.png)

* Use union to display from the tables `customer` and `customer_list` the ID of all customers who live in the city of London. Determine whether both tables contain the same customers by using `UNION ALL`.

![](images/union2.png)

## Hint

* For the second problem, consider using subqueries.

In [22]:
from sqlalchemy import create_engine
import pandas as pd
from warnings import filterwarnings
import pymysql
filterwarnings('ignore', category=pymysql.Warning)
import os
engine = create_engine('mysql+pymysql://root:AQib.21Talib@localhost/sakila')

In [23]:
sql_query = """
select count(*)
from city
"""
city = pd.read_sql_query(sql_query, engine)
city.head()

   count(*)
0       600

In [24]:
sql_query = """
select count(*)
from city
union
select count(*)
from country;
"""
city = pd.read_sql_query(sql_query, engine)
city.head()

   count(*)
0       600
1       109

In [30]:
sql_query = """
select customer_id
from customer
where address_id IN
(
 select address_id
 from address
 where city_id IN
  (
   select city_id
   from city
   where city = 'London'
  )
 )
union all
select id
from customer_list
where city = 'London';
"""
city = pd.read_sql_query(sql_query, engine)
city.head()

   customer_id
0          252
1          512
2          252
3          512

In [27]:
sql_query = """
select customer_id
from customer
where address_id IN
(
  select address_id
  from address
  where city_id IN
  (
    select city_id
    from city
    where city = 'London'
  )
)
union all
select id
from customer_list
where city = 'London';
"""
city = pd.read_sql_query(sql_query, engine)
city

   customer_id
0          252
1          512
2          252
3          512